wisteria-1c/Конфигурация/Catalogs/ГруппыАдреснойКниги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ГруппыАдреснойКниги</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доступ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоступовГруппАдреснойКниги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

wisteria-1c/Конфигурация/InformationRegisters/СоставыГруппАдреснойКниги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СоставыГруппАдреснойКниги</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ГруппаАдреснойКниги</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыАдреснойКниги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонтактCRM</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтактПисьма</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

wisteria-1c/Конфигурация/Catalogs/ГруппыАдреснойКниги/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	Элементы.Список.МножественныйВыбор = ?(Параметры.ЗакрыватьПриВыборе = Неопределено, Ложь,
		Не Параметры.ЗакрыватьПриВыборе);
	Если Параметры.РежимВыбора Тогда
		КлючНазначенияИспользования = "ВыборПодбор";
		РежимБлокировкиПриОткрытииОкна = РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца;
	Иначе
		КлючНазначенияИспользования = "Список";
	КонецЕсли;

	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Доступ") Тогда

		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Доступ",
			Параметры.Отбор.Доступ);

	КонецЕсли;

	Если ЗначениеЗаполнено(Параметры.ВыбранныеАдресаты) Тогда

		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка",
			ГруппыВыбранныхАдресатов(Параметры.ВыбранныеАдресаты), ВидСравненияКомпоновкиДанных.ВСписке);
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;

	КонецЕсли;

	Список.Параметры.УстановитьЗначениеПараметра("Автор", Пользователи.ТекущийПользователь());

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ГруппыВыбранныхАдресатов(ВыбранныеАдресаты)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СоставыГруппАдреснойКниги.ГруппаАдреснойКниги КАК ГруппаАдреснойКниги
	|ИЗ
	|	РегистрСведений.СоставыГруппАдреснойКниги КАК СоставыГруппАдреснойКниги
	|ГДЕ СоставыГруппАдреснойКниги.КонтактCRM В (&ВыбранныеАдресаты)";

	Запрос.УстановитьПараметр("ВыбранныеАдресаты", ВыбранныеАдресаты);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Новый Массив;
	КонецЕсли;

	Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ГруппаАдреснойКниги");
	Возврат Результат;

КонецФункции

#КонецОбласти
